var json = '{"status":"ok","message":[{ "href": "http://javalibre.com.ua/java-book/book/737", "title":"\„Гаррi Поттер i фiлософський камiнь\”","author":"Джоан К. Ролінґ","img":"img/1000021-pic_1.jpg","article":"Життя в комірчині під сходами, доношування одягу за братом, відсутність батьківської турботи - може закінчиться добре. Нагородою стануть незвичайна школа й віддані друзі. А ще - цілий світ, де є чарівне дзеркало і філософський камінь. Але він доступний тільки безкорисливій людині. Щоб дізнатися, чи такий головний герой книги, необхідно дочитати її до кінця.Це перша книга про Гаррі Поттера. Відірвавшись від комп\'ютерів і телеекранів, сотні мільйонів дітей та дорослих у всьому світі ЗНОВУ ЧИТАЮТЬ! Такого успіху не знала жодна художня книга. Казка про хлопчика-чарівника Гаррі Поттера зачарувала всю планету..."},{"href": "http://javalibre.com.ua/java-book/book/733", "title":"\„Гаррi Поттер i таємна кімната\”","author":"Джоан К. Ролінґ","img":"img/garry-potter-2.jpg","article":"Гаррі стає свідком страшних подій, що розгортаються в Гоґвортсі: учні перетворюються на статуї. А Гаррі весь цей час чує зловісний голос, який, здавалося б, йде з нізвідки. Незабаром учні дізнаються про існування Таємної кімнати, відкрити яку в змозі тільки єдиний спадкоємець Салазара Слизерина. Усі думають, що Таємну кімнату відкрив саме Гаррі і звільнив ув’язнений у ній Жах, адже справа в тому, що Поттер розуміє змій і вміє говорити на їхній мові. Гаррі Поттер – парселмовець!"},{"href": "http://javalibre.com.ua/java-book/book/732","title":"\„Гаррі Поттер і в\'язень Азкабану\”","author":"Джоан К. Ролінґ","img":"img/garry-potter-3.jpg","article":"Новий семестр у Гоґвортсі обіцяє багато подій! Ви дізнаєтеся, як Гаррі вивчає нові премудрості чарівництва, приручає гіпогріфа Бакбика, а також потайки проникаючи в село Гоґсмід. Порушив цю ідилію вбивця що проник у Гоґвортс, на рахунку якого безліч життів людей, і чарівників. Для охорони школи запрошені страшні вартові в\’язниці Азкабан – дементори..."},{"href": "http://javalibre.com.ua/java-book/book/736","title":"\„Гаррі Поттер і келих вогню\”","author":"Джоан К. Ролінґ","img":"img/garry-potter-4.jpg","article":"Гаррі Поттер, Рон і Герміона повертаються на четвертий курс до Школи Магії і Чарів Гоґвортс. При таємничих обставинах Гаррі відібрано до числа учасників небезпечного змагання – Турніру Трьох Чарівників, однак проблема в тому, що всі його суперники – набагато старші і сильніші. Дуже скоро Гаррі належить поборотися не лише за перемогу в змаганні, але й, за власне життя..."},{"href": "http://javalibre.com.ua/java-book/book/735","title":"\„Гаррі Поттер і орден Фенікса\”","author":"Джоан К. Ролінґ","img":"img/garry-potter-5.jpg","article":"Побоюючись, що голова Гоґвортса Албус Дамблдор поширює брехливі чутки про повернення Волдеморта, Міністерство Магії призначає нового професора захисту від темних мистецтв - Долорес Амбрідж. Однак її курс лекцій із захисної магії виявляється абсолютно некорисним. Гаррі Поттер бере ініціативу у свої руки, таємно організувавши групу студентів і навчаючи їх самозахисту від злих сил..."},{"href":"http://javalibre.com.ua/java-book/book/402", "title":"\„Гаррі Поттер і напівкровний принц\”","author":"Джоан К. Ролінґ", "img":"img/garry-potter-6.jpg","article": "Стоїть середина літа, але незвичайний для цієї пори року туман обволікає вікна густою пеленою. Сидячи в своїй кімнаті в будинку Дурслів, Гаррі Поттер з нетерпінням чекає на самого професора Дамблдора. Востаннє він бачив директора школи Хогвартс під час жорстокої дуелі з Лордом Волдемортом, і Гаррі важко повірити, що професор Дамблдор з\’явиться саме тут, у Дурслів. Навіщо професорові відвідувати його? Яка термінова справа не терпить зволікання до повернення Гаррі в Хогвартс через кілька тижнів? Шостий рік навчання в Хогвартсі починається для Гаррі дуже дивно, якщо світи маглів і чарівників так щільно переплелися…"},{"href": "http://javalibre.com.ua/java-book/book/734","title":"\„Гаррі Поттер і смертельні реліквії\”","author":"Джоан К. Ролінґ","img":"img/garry-potter-7.jpg","article":"Гаррі, Рон і Герміона повертаються у Гоґвортс, щоб знайти і знищити останній горокракс Волдеморта, але коли Волдеморт дізнається про їхні плани розпочнеться небачена битва, між добром та злом, яку майже переміг Темний Лорд і Смертежери. Але безсмертний Гаррі Поттер, біля стін Гоґвортсу, розставив все на свої місця: добро перемогло зло."},{"href": "http://libruk.in.ua/frensis-skott-fitsdzherald-velikij-getsbi","title":"\„Великий Гетсбі\”","author":"Френсіс С. Фіцджеральд","img":"img/gatsby.jpg","article":"Це - \“Великий Гетсбі\”. Найзнаменитіший з романів Фіцджеральда. Вишукана і дивовижно жива історія \“шляху нагору\” і \“життя нагорі\” сильного чоловіка, який щиро вважав, що досягши вершин влади і багатства автоматично знаходиться і щастя. Чоловіка, чия втрата ілюзій була повільною - і дуже жорстокою..."},{"href": "http://javalibre.com.ua/java-book/book/2917082","title":"\„Біле Ікло\”","author":"Джек Лондон","img":"img/white-fang.jpg","article":"Розповіді про Аляску зробили знаменитим їх автора не тільки героїчною тематикою, величними пейзажами і гострими ситуаціями: пафос їх - не в боротьбі за золото, а в боротьбі за людські душі. Людина, совість якої не замерзає навіть при лютих північних морозах, - от справжній герой ранніх оповідань Лондона.Повість оповідає про життя малого вовченяти у лісі та серед людей, подекуди жорстокіших за найлютіших тварин."},{"href": "http://knigger.org/remarque/about/drei_kameraden?hl=ua","title":"\„Три товариші\”","author":"Еріх Марія Ремарк","img":"img/three-comrades.jpg","article":"Роман «Три товариші» (1937) продовжує найвизначнішу для Ремарка тему — тему фронтової дружби, яка підтримує головних героїв, не дозволяючи їм остаточно зневіритися у житті. Тільки такі люди можуть протистояти бездушному світу гендлярства і суцільної байдужості та зневаги до людей, що охопили країну після Першої світової. Любов Роббі і Патриції — це те невимовне диво, що на нього вже і не чекають герої і яке відроджує сподівання, що людяність перемагає завжди."}]}'
var obj = JSON.parse(json)
var message = obj.message
var section = document.getElementById("content")
document.body.onload = addElement
var newSection = document.createElement("section")
document.body.appendChild(newSection)

    function addElement()
    {
        "use strict"
         for (var i = 0; i < message.length; i++)
        { 
            var newArticle = document.createElement("article")
            newSection.appendChild(newArticle)

            var newFigure = document.createElement("figure")
            newArticle.appendChild(newFigure)

            var newImg = document.createElement("img")
            newFigure.appendChild(newImg)
            newImg.setAttribute("src", message[i].img)
            newImg.setAttribute("height","280")
            newImg.setAttribute("width","180")

            var newA = document.createElement("a")
            newArticle.appendChild(newA)
            newA.setAttribute("href", message[i].href)

            var H2 = document.createElement("h2")
            newA.appendChild(H2);
            H2.textContent = message[i].title 

            var H3 = document.createElement("h3")
            newArticle.appendChild(H3)
            H3.textContent = message[i].author
            newArticle.appendChild(H3)

            var newP = document.createElement("p")
            newArticle.appendChild(newP)
            newP.className = "annotation"
            newP.textContent = message[i].article 
      
        }
    }
var footer = document.getElementsByTagName("footer")[0]
footer.parentNode.insertBefore(newSection,footer)