import React from 'react';

import BookItem from '../bookItem/BookItem';

import styles from './BookList.css';

const books = [
  {
    _id: '1',
    img: '../img/garry-potter-1.jpg',
    title: 'Гаррi Поттер i фiлософський камiнь',
    linkTo: 'http://javalibre.com.ua/java-book/book/737',
    author: 'Джоан К. Ролінґ',
    description: 'Життя в комірчині під сходами, доношування одягу за братом, відсутність батьківської турботи - може закінчиться добре. Нагородою стануть незвичайна школа й віддані друзі. А ще - цілий світ, де є чарівне дзеркало і філософський камінь. Але він доступний тільки безкорисливій людині. Щоб дізнатися, чи такий головний герой книги, необхідно дочитати її до кінця.Це перша книга про Гаррі Поттера. Відірвавшись від комп\'ютерів і телеекранів, сотні мільйонів дітей та дорослих у всьому світі ЗНОВУ ЧИТАЮТЬ! Такого успіху не знала жодна художня книга. Казка про хлопчика-чарівника Гаррі Поттера зачарувала всю планету...',
  },
  {
    _id: '2',
    linkTo: 'http://javalibre.com.ua/java-book/book/733',
    title: 'Гаррi Поттер i таємна кімната',
    author: 'Джоан К. Ролінґ',
    img: '../img/garry-potter-2.jpg',
    description: 'Гаррі стає свідком страшних подій, що розгортаються в Гоґвортсі: учні перетворюються на статуї. А Гаррі весь цей час чує зловісний голос, який, здавалося б, йде з нізвідки. Незабаром учні дізнаються про існування Таємної кімнати, відкрити яку в змозі тільки єдиний спадкоємець Салазара Слизерина. Усі думають, що Таємну кімнату відкрив саме Гаррі і звільнив ув’язнений у ній Жах, адже справа в тому, що Поттер розуміє змій і вміє говорити на їхній мові. Гаррі Поттер – парселмовець!',
  },
  {
    _id: '3',
    linkTo:"http://javalibre.com.ua/java-book/book/732",
    title: 'Гаррі Поттер і в\'язень Азкабану',
    author:"Джоан К. Ролінґ",
    img:"../img/garry-potter-3.jpg",
    description:"Новий семестр у Гоґвортсі обіцяє багато подій! Ви дізнаєтеся, як Гаррі вивчає нові премудрості чарівництва, приручає гіпогріфа Бакбика, а також потайки проникаючи в село Гоґсмід. Порушив цю ідилію вбивця що проник у Гоґвортс, на рахунку якого безліч життів людей, і чарівників. Для охорони школи запрошені страшні вартові в\’язниці Азкабан – дементори..."
  },
  {
    _id: '4',
    "linkTo":"http://javalibre.com.ua/java-book/book/736",
    "title": 'Гаррі Поттер і келих вогню',
    "author":"Джоан К. Ролінґ",
    "img":"../img/garry-potter-4.jpg",
    "description":"Гаррі Поттер, Рон і Герміона повертаються на четвертий курс до Школи Магії і Чарів Гоґвортс. При таємничих обставинах Гаррі відібрано до числа учасників небезпечного змагання – Турніру Трьох Чарівників, однак проблема в тому, що всі його суперники – набагато старші і сильніші. Дуже скоро Гаррі належить поборотися не лише за перемогу в змаганні, але й, за власне життя..."
  },
];


function BookList() {
  return(
    <section className={styles.listBooks}>
      {books.map((book) => (
        <BookItem
          key={book._id}
          _id={book._id}
          img={book.img}
          linkTo={book.linkTo}
          title={book.title}
          author={book.author}
          description={book.description}
        />
      ))}
    </section>
  )
}

export default BookList;
